# usage: for cycle
# date: 2019/11/18
# filepath: cloud1908/01.oneday/04.forcycle.py


# shell for
# for i in {1..100};do
#   echo ${i}
# done

# python for: range就是产生自然数的区间: 特点: 左闭右开区间
for i in range(100):
    print(-i)

# 1-100中所有的偶数
for n in range(1, 101):
    if n % 2 == 0:
        print(n)

# while cycle:
n = 0
while n <= 100:
    print(n)
    n += 1  # n = n + 1

# 死循环
# while True:
#     pass

# 思考题:
#   有这样一个阶梯;
#   每走2层最后剩下一层;每走3层剩下2层;每走4层剩下3层;
#   每走5层最后剩下4层;每走6层剩下5层;每次走7层恰好走完;
#   请问阶梯最短有多少层?


# 练习题:
# 1. 写一个程序判断用户输入的是不是数字, 如果是那么是否是奇数?
# 2. 写一个程序来计算用户输入数字的立方
# 3. 写一个程序来计算人民币转化为欧元
# 4. 根据输入的成绩进行打分, 学习成绩>=90分的同学用A表示;60-89分之间的用B表示;60分以下的用C表示;
# 5. 写一个程序判断用户输入的内容是否为空, 若为空则直接提示用户重新输入, 若不为空则打印用户输入



